In [1]:
import pandas as pd

In [8]:
df1 = pd.DataFrame({
    'Name' : ['Rajeev','Sameer','Karan'],
    'Chemistry' : [78 , 89 ,83],
    'Maths' : [74, 85,88]
})

df2 = pd.DataFrame({
    'Name' : ['Sameer','Rajeev','Karan'],
    'Physics' :[79,67,77]
}, index =[1,0,2])

In [9]:
pd.concat([df1,df2] , axis =1)

     Name  Chemistry  Maths    Name  Physics
0  Rajeev         78     74  Rajeev       67
1  Sameer         89     85  Sameer       79
2   Karan         83     88   Karan       77

In [10]:
df3 = pd.DataFrame({
    'Name' : ['Arjun','Ravi','Harsh'],
    'Chemistry' : [67,78,63],
    'Maths' : [89,88,58]
})
df3

    Name  Chemistry  Maths
0  Arjun         67     89
1   Ravi         78     88
2  Harsh         63     58

In [13]:
pd.concat([df1,df3],ignore_index = True)

     Name  Chemistry  Maths
0  Rajeev         78     74
1  Sameer         89     85
2   Karan         83     88
3   Arjun         67     89
4    Ravi         78     88
5   Harsh         63     58

In [15]:
a = pd.concat([df1,df3], keys = ['Section A','Section B'])
a

               Name  Chemistry  Maths
Section A 0  Rajeev         78     74
          1  Sameer         89     85
          2   Karan         83     88
Section B 0   Arjun         67     89
          1    Ravi         78     88
          2   Harsh         63     58

82.33333333333333